Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Initialize GDI+ library
fr: Initialise la bibliothèque GDI +

source: Capture 32 bit bitmap
fr: Capture un bitmap 32 bits

source: Create 24 bit bitmap clone
fr: Crée un clone 24 bits du bitmap

source: Save bitmap to file
fr: Enregistre le bitmap dans un fichier

source: Shut down GDI+ library
fr: Arrête la bibliothèque GDI +

source: Converts a bitmap to a specified pixel format
fr: Convertit un bitmap en un format de pixel spécifié

source: Pixel format constant that specifies the new pixel format ($GDIP_PXF*).
fr: Constante de format de pixel qui spécifie le nouveau format de pixel ($GDIP_PXF*).

source: DitherType constant that specifies the dithering algorithm ($GDIP_DitherType*).
fr: Constante DitherType qui spécifie l'algorithme de tramage ($GDIP_DitherType*).

source: PaletteType constant that specifies a standard palette to be used for dithering ($GDIP_PaletteType*).
fr: Constante PaletteType qui spécifie une palette standard à utiliser pour le tramage ($GDIP_PaletteType*).

source: Structure that specifies the palette whose indexes are stored in the pixel data of the converted bitmap.
fr: Structure qui spécifie la palette dont les index sont stockées dans les données de pixels de l'image bitmap converti.

source: Real number in the range 0.0 through 100.0 that specifies which pixels in the source bitmap will map to the transparent color in the converted bitmap.
fr: Nombre réel dans la fourchette entre 0,0 et 100,0 qui spécifie quels pixels de l'image source sera de couleur transparente dans le bitmap converti.

source: The original pixel data in the bitmap is replaced by the new pixel data.
fr: La donnée d'un pixel d'origine dans l'image bitmap est remplacé par la nouvelle donnée de pixel.

source: Search GdipBitmapConvertFormat in MSDN Library
fr: Consultez GdipBitmapConvertFormat dans la Librairie MSDN.

source: Convert to a 16-color bitmap (4 bits per pixel) using diffusion dithering
fr: Convertit en bitmap 16 couleurs (4 bits par pixel) en utilisant la tramage de diffusion

source: Creates a new Bitmap by applying a specified effect to an existing Bitmap
fr: Crée un nouveau Bitmap en appliquant un effet spécifié à un Bitmap existant

source: a $tagRECT structure that specifies the portion of the input bitmap that is used.
fr: Structure $tagRECT qui définit la partie du bitmap d'entrée qui est utilisé.

source: a $tagRECT structure that receives the portion of the input bitmap that was used.
fr: Structure $tagRECT qui reçoit la partie du bitmap d'entrée qui est utilisé.

source: a handle to a Bitmap object.
fr: Retourne le handle de l'objet Bitmap.

source: When you are done with the Effect object, call _GDIPlus_EffectDispose() to release the resources.
fr: Lorsque vous en avez terminé avec l'objet Effect, appelez _GDIPlus_EffectDispose() pour libérer les ressources.

source: Search GdipBitmapCreateApplyEffect in MSDN Library
fr: Consultez GdipBitmapCreateApplyEffect dans la Librairie MSDN.

source: Create a Bitmap object from file
fr: Crée un objet bitmap à partir d'un fichier

source: Path to a bitmap file
fr: Chemin du fichier Bitmap

source: When you are done with the Bitmap object, call _GDIPlus_BitmapDispose() to release the resources.
fr: Lorsque vous en avez terminé avec l'objet bitmap, appelez _GDIPlus_BitmapDispose() pour libérer les ressources.

source: Search GdipCreateBitmapFromFile in MSDN Library
fr: Consultez GdipCreateBitmapFromFile dans la Librairie MSDN.

source: Draw bitmap to GUI
fr: Dessine le bitmap dan la GUI

source: Creates a Bitmap object based on a Graphics object, a width, and a height
fr: Crée un objet Bitmap à partir d'un objet Graphics, avec une largeur et une hauteur données

source: Specifies the width, in pixels, of the bitmap
fr: Spécifie la largeur, en pixels, du bitmap

source: Specifies the height, in pixels, of the bitmap
fr: Spécifie la hauteur, en pixels, du Bitmap

source: Handle to a Graphics object
fr: Handle de l'objet Graphics

source: a handle to a Bitmap object Q .
fr: Retourne le handle de l'objet Bitmap

source: Search GdipCreateBitmapFromGraphics in MSDN Library
fr: Consultez GdipCreateBitmapFromGraphics dans la Librairie MSDN.

source: initialize GDI+
fr: Initialise GDI+

source: $iBGColor format RRGGBB
fr: $iBGColor est au format RRGGBB

source: create a test GUI
fr: Crée une interface de test

source: set GUI background color
fr: définir l'interface graphique couleur de fond

source: create buffered graphics frame set for smoother gfx object movements
fr: Créer un buffer graphique pour fluidifier les déplacements d'objets

source: create a graphics object from a window handle
fr: créer un objet graphique à partir d'un handle fenêtre

source: create a Bitmap object based on a graphics object
fr: Crée un objet Bitmap basé sur un objet graphique

source: get the graphics context of the image / bitmap to draw on image / bitmap
fr: Obtient le contexte graphique de l'image/bitmap pour dessiner dans l'image/bitmap

source: sets the graphics object rendering quality (antialiasing)
fr: Définit pour l'objet graphique la qualité de rendu antialiasing

source: create a solid Brush object
fr: Crée un objet Brush solide

source: ACos(-1) is nearly pi
fr: ACos(-1) est presque pi

source: clear bitmap with given color (AARRGGBB format)
fr: Efface le bitmap avec une couleur donnée (en format AARRGGBB)

source: draw dots in a circle
fr: Dessine des points dans un cercle

source: increase angle to next dot
fr: Augmente l'angle pour le prochain point

source: increase overall angle
fr: Augmente l'angle global

source: copy drawn bitmap to GUI
fr: Copie le bitmap dessiné dans la GUI

source: Sleep() always returns 1 and Not 1 is 0
fr: Sleep() retourne toujours 1 et non 1 ou 0

source: cleanup GDI+ resources
fr: Nettoie les ressources GDI+

source: Create a Bitmap object from a bitmap handle
fr: Crée un objet Bitmap à partir du handle d'un Bitmap

source: Handle to a HBITMAP
fr: Handle du HBITMAP

source: Handle to a HPALETTE
fr: Handle du HPALETTE

source: Search GdipCreateBitmapFromHBITMAP in MSDN Library
fr: Consultez GdipCreateBitmapFromHBITMAP dans la Librairie MSDN.

source: Capture upper left corner of screen
fr: Capture le coin supérieur gauche de l'écran

source: Creates a Bitmap object based on an icon
fr: Crée un objet Bitmap à partir d'une icône

source: Handle to an icon
fr: Handle d'une icône

source: When you are done with the Bitmap object, call _GDIPlus_ImageDispose() to release the resources.
fr: Lorsque vous en avez terminé avec l'objet Bitmap, appelez _GDIPlus_ImageDispose() pour libérer les ressources.

source: Search GdipCreateBitmapFromHICON in MSDN Library
fr: Consultez GdipCreateBitmapFromHICON dans la Librairie MSDN.

source: Create a graphics object from a window handle
fr: Crée un objet graphique à partir du handle fenêtre

source: Loop until user exits
fr: Boucle jusqu'à ce que l'utilisateur quitte

source: Creates a Bitmap object based on a 32bit icon
fr: Crée un objet Bitmap à partir d'une icône 32 bits

source: Loads an image (JPG, BMP, PNG, etc.) which is saved as a binary string and converts it to a bitmap (GDI+) or hbitmap (GDI)
fr: Charge une image (JPG, BMP, PNG, etc.)qui est enregistré comme une chaîne binaire et la convertit en un bitmap (GDI+) ou hbitmap (GDI)

source: The binary string which contains any valid image which is supported by GDI+
fr: La chaîne binaire qui contient une image valide qui est prise en charge par GDI+

source: If False a bitmap will be created, if True a hbitmap (GDI) will be created
fr: Si False un bitmap sera créé, si True un hbitmap (GDI) sera créé

source: a handle to bitmap (GDI+ bitmap format) or hbitmap (WinAPI bitmap format).
fr: Retourne le handle du bitmap (format GDI+ ) ou hbitmap (format WinAPI).

source: 1 - $dImage is not a binary string
fr: 1 - $dImage n'est pas une chaîne binaire

source: 2 - unable to create stream on HGlobal
fr: 2 - impossible de créer un flux sur hGlobal

source: 3 - unable to create bitmap from stream
fr: 3 - impossible de créer un bitmap à partir du flux

source: 4 - unable to allocate moveable memory block
fr: 4 - impossible d'allouer un bloc de mémoire mobile

source: 5 - unable to lock moveable memory block
fr: 5 - impossible de verrouiller un bloc de mémoire mobile

source: 6 - unable to unlock locked moveable memory block
fr: 6 - impossible de déverrouiller le bloc de mémoire mobile verrouillé

source: After you are done with the object, call _GDIPlus_ImageDispose() to release the object resources.
fr: Lorsque vous en avez terminé avec l'objet, appelez _GDIPlus_ImageDispose() pour libérer les ressources de l'objet.

source: Search CreateDIBSection in MSDN Library
fr: Consultez CreateDIBSection dans la Librairie MSDN.

source: $iBgColor format RRGGBB
fr: $iBgColor est au format RRGGBB

source: load binary saved GIF image and convert it to GDI+ bitmap format
fr: Charge le binaire, sauvegarde l'image GIF et la convertit au format bitmap GDI+

source: display image in GUI
fr: Affiche l'image dans la GUI

source: test GIF image converted to a binary string
fr: Image GIF d'essai convertie en une chaîne binaire

source: Handle to an instance of a module whose executable file contains a bitmap resource
fr: Handle d'une instance d'un module dont le fichier exécutable contient une ressource bitmap

source: The resource name string or identifier
fr: La chaîne du nom ou l'identifiant de la ressource

source: Search GdipCreateBitmapFromResource in MSDN Library
fr: Consultez GdipCreateBitmapFromResource dans la Librairie MSDN.

source: get path to the Aut2Exe.exe file
fr: Obtient le chemin vers le fichier Aut2Exe.exe

source: maps a specified executable module into the address space of the calling process
fr: Mappe un module exécutable spécifié dans l'espace d'adressage du processus appelant

source: load bitmap resource "BMP_MAINLOGO" and convert it to GDI+ bitmap format
fr: Charge la ressource bitmap "BMP_MAINLOGO" et la convertit au format bitmap GDI+

source: display image in GUI centered
fr: Affiche l'image dans la GUI centrée

source: Creates a Bitmap object based on an array of bytes along with size and format information
fr: Crée un objet Bitmap à partir d'un tableau d'octets avec les informations de taille et de format

source: The bitmap width, in pixels.
fr: La largeur du bitmap, en pixels.

source: The bitmap height, in pixels.
fr: La hauteur du bitmap, en pixels.

source: Specifies the format of the pixel data.
fr: Spécifie le format des données de pixels.

source: Integer that specifies the byte offset between the beginning of one scan line and the next.
fr: Entier qui spécifie l'offset de l'octet entre le début d'une ligne de balayage et la suivante.

source: Pointer to an array of bytes that contains the pixel data.
fr: Pointeur vers un tableau d'octets qui contient les données de pixels.

source: After you are done with the object, call _GDIPlus_BitmapDispose() to release the object resources.
fr: Lorsque vous en avez terminé avec l'objet, appelez _GDIPlus_BitmapDispose() pour libérer les ressources de l'objet.

source: Search GdipCreateBitmapFromScan0 in MSDN Library
fr: Consultez GdipCreateBitmapFromScan0 dans la Librairie MSDN.

source: create an empty bitmap
fr: Crée un bitmap vide

source: get the graphics context of the bitmap
fr: Obtient le contexte graphique de l'image bitmap

source: clear bitmap with color white
fr: Efface le bitmap avec la couleur blanche

source: draw some text to the bitmap
fr: Dessine un peu de texte dans le bitmap

source: save bitmap to disk
fr: Sauvegarde le bitmap sur le disque

source: open bitmap with default app
fr: Ouvre le bitmap avec l'application par défaut

source: Creates a Bitmap object based on an IStream COM interface
fr: Crée un objet Bitmap à partir d'une interface COM IStream

source: Pointer to an IStream COM interface
fr: Pointeur sur une interface COM IStream

source: Search GdipCreateBitmapFromStream in MSDN Library
fr: Consultez GdipCreateBitmapFromStream dans la Librairie MSDN.

source: create a GDI bitmap by capturing 1/4 of desktop
fr: Crée un bitmap GDI en capturant un quart de bureau

source: convert GDI bitmap to GDI+ bitmap
fr: Convertit le bitmap GDI en bitmap GDI+

source: release GDI bitmap resource because not needed anymore
fr: Libére les ressources du bitmap GDI car ne sont plus nécessaires

source: create CLSID for a JPG image file type
fr: Crée un CLSID pour un type de fichier d'image jpg

source: convert CLSID GUID to binary form and returns $tagGUID structure
fr: Convertit CLSID GUID en binaire et retourne la structure $tagGUID

source: get pointer of $tagGUID structure
fr: Obtient un pointeur sur la structure $tagGUID

source: initialize an encoder parameter list and return $tagGDIPENCODERPARAMS structure
fr: Initialise une liste de paramètres d'encodeur et retourne $tagGDIPENCODERPARAMS

source: create struct to set JPG quality setting
fr: Crée une structure pour définir le réglage de qualité JPG

source: quality 0-100 (0: lowest, 100: highest)
fr: Qualité 0-100 (0 : plus bas, 100 : le plus élevé)

source: get pointer from quality struct
fr: Obtient un pointeur sur la structure qualité

source: add a value to an encoder parameter list
fr: Ajoute une valeur à une liste de paramètres d'encodeur

source: get pointer of encoder parameter list
fr: Obtient un pointeur sur la liste des paramètres d'encodeur

source: create stream
fr: Crée un flux

source: save the bitmap in JPG format in memory
fr: Enregistre le bitmap au format JPG dans la mémoire

source: create bitmap from a stream (here from the JPG in memory)
fr: Crée un bitmap à partir du flux (ici à partir du JPG en mémoire)

source: display streamed image
fr: Affichage l'image en streaming

source: cleanup resources
fr: Nettoie

source: Create a handle to a bitmap from a bitmap object
fr: Crée le handle d'un Bitmap à partir d'un objet Bitmap

source: Handle to a bitmap object
fr: Handle de l'objet Bitmap

source: Color object that specifies the background color
fr: Couleur de l'arrière-plan

source: a handle to a HBITMAP.
fr: Retourne le handle du HBITMAP

source: When you are done with the Bitmap object, call _WinAPI_DeleteObject() to release the resources.
fr: Lorsque vous en avez terminé avec l'objet bitmap, appelez la fonction _WinAPI_DeleteObject pour libérer les ressources

source: Search GdipCreateHBITMAPFromBitmap in MSDN Library
fr: Consultez GdipCreateHBITMAPFromBitmap dans la Librairie MSDN.

source: Load image
fr: Charge l'image

source: True -> $hBMP destroyed
fr: True - > détruit $hBMP

source: Clean up resource
fr: Nettoie les ressources

source: Release a bitmap object
fr: Libère un objet Bitmap

source: Search GdipDisposeImage in MSDN Library
fr: Consultez GdipDisposeImage dans la Librairie MSDN.

source: create a bitmap object from file
fr: Crée un objet bitmap à partir du fichier

source: save image in JPG format
fr: Enregistre l'image au format JPG

source: release a bitmap object
fr: Libére un objet bitmap

source: Returns one or more histograms for specified color channels of the specified Bitmap
fr: Retourne un ou plusieurs histogrammes pour les canaux de couleurs spécifiés d'un bitmap donné

source: HistogramFormat constant that specifies the channels for which histograms will be created ($GDIP_HistogramFormat*).
fr: Constante HistogramFormat qui spécifie les canaux pour lesquels les histogrammes seront créés ($GDIP_HistogramFormat*).

source: Number of elements in each of the arrays pointed to by $tChannel_0, $tChannel_1, $tChannel_2, and $tChannel_3?
fr: Nombre d'éléments dans chacun des tableaux pointé par $tChannel_0, $tChannel_1, $tChannel_2, et $tChannel_3 ?

source: A DLL struct array of UINTs that receives the first histogram.
fr: Un tableau de structure DLL de UINTs qui reçoit le premier histogramme.

source: A DLL struct array of UINTs that receives the second histogram if there is a second histogram.
fr: Un tableau de structure DLL de UINTs qui reçoit le deuxième histogramme s'il existe un deuxième histogramme.

source: Pass NULL if there is no second histogram.
fr: Passez NULL s'il n'y a pas de deuxième histogramme.

source: A DLL struct array of UINTs that receives the third histogram if there is a third histogram.
fr: Un tableau de structure DLL de UINTs qui reçoit le troisième histogramme si il existe un troisième histogramme.

source: Pass NULL if there is no third histogram.
fr: Passez NULL s'il n'y a pas de troisième histogramme.

source: A DLL struct array of UINTs that receives the fourth histogram if there is a fourth histogram.
fr: Un tableau de structure DLL de UINTs qui reçoit le quatrième histogramme s'il existe un quatrième histogramme.

source: Pass NULL if there is no fourth histogram.
fr: Passez NULL s'il n'y a pas de quatrième histogramme.

source: The number of histograms returned depends on the $iHistogramFormat parameter.
fr: Le nombre d'histogrammes retournés dépend du paramètre $iHistogramFormat.

source: For example, if format is equal to $GDIP_HistogramFormatRGB, then three histograms are returned: one each for the red, green, and blue channels.
fr: Par exemple, si le format est égal à $GDIP_HistogramFormatRGB, alors trois histogrammes sont retournés : un pour chacun des canaux rouge, vert et bleu.

source: In that case, $tChannel_0 receives the red-channel histogram, $tChannel_1 receives the green-channel histogram, and $tChannel_2 receives the blue-channel histogram.
fr: Dans ce cas, $tChannel_0 reçoit l'histogramme du canal rouge, $tChannel_1 reçoit l'histogramme du canal vert, et $tChannel_2 reçoit l'histogramme du canal bleu.

source: For $GDIP_HistogramFormatRGB, $tChannel_3 must be set to NULL because there is no fourth histogram
fr: Pour $GDIP_HistogramFormatRGB, $tChannel_3 doit être mis à NULL car il n'y a pas de quatrième histogramme

source: Search GdipBitmapGetHistogram in MSDN Library
fr: Consultez GdipBitmapGetHistogram dans la Librairie MSDN.

source: Returns histograms for the Bitmap´s color channels:
fr: Retourne les histogrammes des canaux de couleur d'un bitmap:

source: Red, Green, Blue, Alpha and Grey
fr: Rouge, Vert, Bleu, Alpha et Gris

source: an histogram structure:
fr: Retourne une structure d'histogramme :

source: Size - UINT number of elements in each of the histogram arrays
fr: Size - UINT nombre d'éléments de chaque tableaux d'histogramme

source: Red - UINT[Size] struct array of colorchannel RED histogram
fr: Red - UINT[Size] structure tableau de l'histogramme RED

source: MaxRed - UINT maximum value of the RED histogram
fr: MaxRed - UINT valeur maximale de l'histogramme RED

source: Green - UINT[Size] struct array of colorchannel GREEN histogram
fr: Green - UINT[Size] structure tableau de l'histogramme GREEN

source: MaxGreen - UINT maximum value of the RED histogram
fr: Maxgreen - UINT valeur maximum de l'histogramme GREEN

source: Blue - UINT[Size] struct array of colorchannel BLUE histogram
fr: Blue - UINT[Size] structure tableau de l'histogramme BLUE

source: MaxBlue - UINT maximum value of the RED histogram
fr: MaxBlue - UINT valeur maximale de l'histogramme BLUE

source: Alpha - UINT[Size] struct array of colorchannel ALPHA histogram
fr: Alpha - UINT[Size] structure tableau de l'histogramme ALPHA

source: MaxAlpha - UINT maximum value of the RED histogram
fr: MaxAlpha - UINT valeur maximum de l'histogramme ALPHA

source: Grey - UINT[Size] struct array of colorchannel GREY histogram
fr: Gris - UINT[Size] structure tableau de l'histogramme GREY

source: MaxGrey - UINT maximum value of the RED histogram
fr: MaxGrey - UINT valeur maximum de l'histogramme GREY

source: Sets the @error flag to non-zero, @extended may contain GPSTATUS error code ($GPID_ERR*).
fr: Retourne @error <> 0, @extended contient le code erreur GPSTATUS ($GPID_ERR*).

source: 10 - Invalid parameter.
fr: 10 - Paramètre non valide.

source: Returns the number of elements for allocation by _GDIPlus_BitmapGetHistogramEx()
fr: Retourne le nombre d'éléments d'allocation par _GDIPlus_BitmapGetHistogramEx()

source: HistogramFormat constant ($GDIP_HistogramFormat*)
fr: Constante HistogramFormat ($GDIP_HistogramFormat*)

source: the number of elements in each of the arrays that receives the histograms.
fr: Retourne le nombre d'éléments dans chacun des canaux qui reçoivent les histogrammes.

source: Search GdipBitmapGetHistogramSize in MSDN Library
fr: Consultez GdipBitmapGetHistogramSize dans la Librairie MSDN.

source: Gets the color of a specified pixel in this bitmap
fr: Obtient la couleur d'un pixel spécifié dans un bitmap

source: Pointer to the Bitmap object
fr: Handle de l'objet Bitmap

source: The X coordinate of the pixel
fr: La coordonnée X du pixel

source: The Y coordinate of the pixel
fr: La coordonnée Y du pixel

source: the pixel color of the bitmap.
fr: Retourne la couleur du pixel du bitmap.

source: Search GdipBitmapGetPixel in MSDN Library
fr: Consultez GdipBitmapGetPixel dans la Librairie MSDN.

source: create a GDI bitmap by capturing an area on desktop
fr: Crée un bitmap GDI par la capture d'une zone du bureau

source: convert GDI to GDI+ bitmap
fr: Convertit le bitmap GDI en GDI+

source: get current pixel color
fr: Obtient la couleur de pixel courant

source: invert RGB pixel color only
fr: XOR avec la couleur du pixel

source: copy negative bitmap to graphics object (GUI)
fr: Copie le bitmap dans l'objet graphique (GUI)

source: Locks a portion of a bitmap for reading or writing
fr: Verrouille une partie d'un bitmap pour la lecture ou l'écriture

source: X coordinate of the upper-left corner of the rectangle to lock
fr: Coordonnée X de l'angle supérieur gauche du rectangle à verrouiller

source: Y coordinate of the upper-left corner of the rectangle to lock
fr: Coordonnée Y de l'angle supérieur gauche du rectangle à verrouiller

source: The width of the rectangle to lock
fr: Largeur du rectangle à verrouiller

source: The height of the rectangle to lock
fr: Hauteur du rectangle à verrouiller

source: Set of flags that specify whether the locked portion of the bitmap is available for reading or for writing and whether the caller has already allocated a buffer.
fr: Ensemble de paramètres qui spécifie si la partie verrouillée du bitmap est disponible pour la lecture ou l'écriture et si une mémoire tampon est deja allouée.

source: Can be a combination of the following:
fr: Peut être une combinaison des éléments suivants :

source: $GDIP_ILMREAD - A portion of the image is locked for reading
fr: $GDIP_ILMREAD - Une partie de l'image est verrouillée pour la lecture

source: $GDIP_ILMWRITE - A portion of the image is locked for writing
fr: $GDIP_ILMWRITE - Une partie de l'image est verrouillée pour l'écriture

source: $GDIP_ILMUSERINPUTBUF - The buffer is allocated by the user
fr: $GDIP_ILMUSERINPUTBUF - Une mémoire tampon est allouée par l'utilisateur

source: Specifies the format of the pixel data in the temporary buffer.
fr: Spécifie le format des données de pixel dans la mémoire tampon temporaire.

source: Can be one of the following:
fr: Peut être un des éléments suivants :

source: $GDIP_PXF01INDEXED - 1 bpp, indexed
fr: $GDIP_PXF01INDEXED - 1 bpp, indexé

source: $GDIP_PXF04INDEXED - 4 bpp, indexed
fr: $GDIP_PXF04INDEXED - 4 bpp, indexé

source: $GDIP_PXF08INDEXED - 8 bpp, indexed
fr: $GDIP_PXF08INDEXED - 8 bpp, indexé

source: $GDIP_PXF16GRAYSCALE - 16 bpp, grayscale
fr: $GDIP_PXF16GRAYSCALE - 16 bpp, niveaux de gris

source: $GDIP_PXF16RGB555 - 16 bpp; 5 bits for each RGB
fr: $GDIP_PXF16RGB555 - 16 bpp; 5 bits pour chaque composante RVB

source: $GDIP_PXF16RGB565 - 16 bpp; 5 bits red, 6 bits green, and 5 bits blue
fr: $GDIP_PXF16RGB565 - 16 bpp; 5 bits pour la composante rouge, 6 bits pour la composante verte, and 5 bits pour la composante bleue
